namespace EduRate.Models
{
    public enum EducationalStage
    {
        // المرحلة الابتدائية
        Primary1 = 1, // أولى ابتدائي
        Primary2 = 2, // تانية ابتدائي
        Primary3 = 3, // تالتة ابتدائي
        Primary4 = 4, // رابعة ابتدائي
        Primary5 = 5, // خامسة ابتدائي
        Primary6 = 6, // ساتة ابتدائي

        // المرحلة الإعدادية
        Prep1 = 7,    // أولى إعدادي
        Prep2 = 8,    // تانية إعدادي
        Prep3 = 9,    // تالتة إعدادي

        // المرحلة الثانوية
        Sec1 = 10,    // أولى ثانوي
        Sec2 = 11,    // تانية ثانوي
        Sec3 = 12,    // تالتة ثانوي

    
    }
}